supervision/feb2020/paper_so_far/continuations.org
#+LATEX_CLASS_OPTIONS: [a4paper,twoside]
#+OPTIONS: toc:nil 
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \newcommand{\matcont}{\textsc{MatCont}}
#+LATEX_HEADER: \newcommand{\matcontm}{\textsc{MatContM}}
#+LATEX_HEADER: \newcommand{\clmatcont}{\textsc{Cl\_MatCont}}
#+LATEX_HEADER: \newcommand{\inr}[2]{\(#1\in\mathbb{R}^{#2}\)}
#+TITLE: A review of numerical continuation and bifurcation analysis software for computational biology problems
#+AUTHOR: Mark
#+DATE: \today

#+BEGIN_NOTE 
Currently c.3000 words, 47 refs.
Cell systems has a review word limit of 8000 words, 100 refs.


TODO come up with a less verbose title

Perhaps send the preprint to whoever wrote each of the tools, to make sure I haven't missed anything / got anything wrong?
#+END_NOTE

* TODO Abstract
#+BEGIN_EXPORT latex
\begin{abstract}
\end{abstract}
#+END_EXPORT


* TODO Introduction to bifurcation analysis
** TODO : PROOF READ; [intro, remove this header]

Computational biology uses mathematical tools to understand the processes that give rise to living organisms cite:beard2005computational.
One area having seen significant success is the application of ideas from nonlinear dynamics and dynamical systems theory to biological systems.
Here, processes are described in terms of differential equations, which describe how some aspect of interest evolves in time; an introduction to the field can be found in cite:strogatz2018nonlinear,guckenheimer2013nonlinear.
The resulting equations can be analysed both to explain observed phenomena, and to predict novel, unseen behaviours.
Classic examples of this are the work of Hodgkin and Huxley cite:hodgkin1952quantitative, which laid the foundations for classical neuroscience; the Mackey-Glass equation cite:mackey1977oscillation, which studies the effects of time-delayed feedback on respiratory and hematopoietic diseases; and the Lotka-Volterra model cite:volterra1928variations of population dynamics.

The behaviour of all these systems depends on the value of various parameters, such as injected current for a neuron model, or population growth rate in ecological models.
When a change in parameter values causes a change in system behaviour, a bifurcation is said to have occurred; see cite:strogatz2018nonlinear,guckenheimer2013nonlinear,kuznetsov2013elements for an entry point into the literature.
Bifurcations are of great interest in biology cite:guevara2003bifurcations.
They can contribute to a variety of diseases such as schizophrenia cite:an2006schizophrenia, Alzheimer's and Parkinson's disease cite:mustafa2009non, and epilepsy cite:da2003epilepsies,milton2000epilespy.
Mackey and Milton refer to these abnormal behaviours, arising from unwanted bifurcations, as dynamical diseases cite:mackey1987dynamical; progress can be made into understanding these diseases by considering the systems and the bifurcations that lead to them.
Bifurcations can also be used to explain the causes of neuronal spiking and bursting behaviours cite:izhikevich2000neural,izhikevich2007dynamical.
The saddle-node bifurcation can explain bistability in metabolic pathways cite:diaz2010bistable, visual perception tasks cite:chialvo1993modulated, epigenetic regulation cite:jost2014bifurcation, as well as many other biological feedback systems cite:angeli2004detection.

Clearly therefore, bifurcations are a powerful explanatory tool in systems biology.
Nevertheless, the detection and analysis of these bifurcations is often analytically challenging.
Consequently, numerous computational algorithms and software packages have been produced to detect and analyse the bifurcations occuring in a system of equations.
While some publications include a survey of continuation tools (see cite:meijer2009numerical,govaerts2007interactive,dhooge2008new), they focus primarily on the history and design approaches of the software.
This work aims to complement these studies, by providing a review of the most commonly used bifurcation analysis software, and demonstrating how each package can be applied to problems from mathematical biology.
The most commonly used packages are PyDSTool cite:clewley2012hybrid, XPPAUTO cite:ermentrout2002simulating, MatCont cite:dhooge2008new, and CoCo cite:dankowicz2013recipes.
These four packages form the core of this work, however other packages also exist, some of which are discussed in section [[*allude to the existence of non-ODE packages]].

#+BEGIN_COMMENT
 Meijer, Hil, Fabio Dercole, and Bart E. Oldeman. "Numerical Bifurcation Analysis." (2009): 6329-6352.
 (briefly)
 
and

https://link.springer.com/chapter/10.1007/978-1-4020-6356-5_2
(interactive continuation tools, chapter 2 of numerical continuation methods for dynamical systems)
(in lots of depth)

and

Dhooge, Annick, et al. "New features of the software MatCont for bifurcation analysis of dynamical systems." Mathematical and Computer Modelling of Dynamical Systems 14.2 (2008): 147-175.
(briefly)

all contain some form of comparison between numerical bifurcation software.
These are more abot the history and development of the softwares though.
To stay novel, this paper should focus more on being a tutorial about their differences, rather than a review.
#+END_COMMENT

