supervision/feb1010wk5wk6/paper_so_far/continuations.tex
% Created 2020-02-21 Fri 17:14
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,twoside]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[usenames,dvipsnames,svgnames,table]{xcolor}
\newenvironment{NOTE}{\color{red}\bfseries ZZZ}


\usepackage[margin=1in]{geometry}
\newcommand{\matcont}{\textsc{MatCont}}
\newcommand{\matcontm}{\textsc{MatContM}}
\newcommand{\clmatcont}{\textsc{Cl\_MatCont}}
\newcommand{\inr}[2]{\(#1\in\mathbb{R}^{#2}\)}
\author{Mark}
\date{\today}
\title{A review of numerical continuation and bifurcation analysis software for computational biology problems}
\hypersetup{
 pdfauthor={Mark},
 pdftitle={A review of numerical continuation and bifurcation analysis software for computational biology problems},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{NOTE}
Currently c.3000 words, 47 refs.
Cell systems has a review word limit of 8000 words, 100 refs.


TODO come up with a less verbose title

Perhaps send the preprint to whoever wrote each of the tools, to make sure I haven't missed anything / got anything wrong?
\end{NOTE}

\section{{\bfseries\sffamily TODO} Abstract}
\label{sec:org64c599d}
\begin{abstract}
\end{abstract}


\section{{\bfseries\sffamily TODO} Introduction to bifurcation analysis}
\label{sec:org20f845f}
\subsection{{\bfseries\sffamily TODO} : PROOF READ; [intro, remove this header]}
\label{sec:org60b5f17}

Computational biology uses mathematical tools to understand the processes that give rise to living organisms \cite{beard2005computational}.
One area having seen significant success is the application of ideas from nonlinear dynamics and dynamical systems theory to biological systems.
Here, processes are described in terms of differential equations, which describe how some aspect of interest evolves in time; an introduction to the field can be found in \cite{strogatz2018nonlinear,guckenheimer2013nonlinear}.
The resulting equations can be analysed both to explain observed phenomena, and to predict novel, unseen behaviours.
Classic examples of this are the work of Hodgkin and Huxley \cite{hodgkin1952quantitative}, which laid the foundations for classical neuroscience; the Mackey-Glass equation \cite{mackey1977oscillation}, which studies the effects of time-delayed feedback on respiratory and hematopoietic diseases; and the Lotka-Volterra model \cite{volterra1928variations} of population dynamics.

The behaviour of all these systems depends on the value of various parameters, such as injected current for a neuron model, or population growth rate in ecological models.
When a change in parameter values causes a change in system behaviour, a bifurcation is said to have occurred; see \cite{strogatz2018nonlinear,guckenheimer2013nonlinear,kuznetsov2013elements} for an entry point into the literature.
Bifurcations are of great interest in biology \cite{guevara2003bifurcations}.
They can contribute to a variety of diseases such as schizophrenia \cite{an2006schizophrenia}, Alzheimer's and Parkinson's disease \cite{mustafa2009non}, and epilepsy \cite{da2003epilepsies,milton2000epilespy}.
Mackey and Milton refer to these abnormal behaviours, arising from unwanted bifurcations, as dynamical diseases \cite{mackey1987dynamical}; progress can be made into understanding these diseases by considering the systems and the bifurcations that lead to them.
Bifurcations can also be used to explain the causes of neuronal spiking and bursting behaviours \cite{izhikevich2000neural,izhikevich2007dynamical}.
The saddle-node bifurcation can explain bistability in metabolic pathways \cite{diaz2010bistable}, visual perception tasks \cite{chialvo1993modulated}, epigenetic regulation \cite{jost2014bifurcation}, as well as many other biological feedback systems \cite{angeli2004detection}.

Clearly therefore, bifurcations are a powerful explanatory tool in systems biology.
Nevertheless, the detection and analysis of these bifurcations is often analytically challenging.
Consequently, numerous computational algorithms and software packages have been produced to detect and analyse the bifurcations occuring in a system of equations.
While some publications include a survey of continuation tools (see \cite{meijer2009numerical,govaerts2007interactive,dhooge2008new}), they focus primarily on the history and design approaches of the software.
This work aims to complement these studies, by providing a review of the most commonly used bifurcation analysis software, and demonstrating how each package can be applied to problems from mathematical biology.
The most commonly used packages are PyDSTool \cite{clewley2012hybrid}, XPPAUTO \cite{ermentrout2002simulating}, MatCont \cite{dhooge2008new}, and CoCo \cite{dankowicz2013recipes}.
These four packages form the core of this work, however other packages also exist, some of which are discussed in section \ref{sec:org50c18e5}.
