supervision/feb1010wk5wk6/paper_so_far/continuations.tex

\subsection{{\bfseries\sffamily TODO} : PROOF READ; What is a bifurcation and a dynamical system?}
\label{sec:org1d76f44}
This section aims to provide an intuitive introduction to bifurcation theory; it is aimed at the non-specialist, and hence any rigorous analysis is left for the literature.
A more formal introduction to bifurcation theory can be found in \cite{strogatz2018nonlinear,guckenheimer2013nonlinear,kuznetsov2013elements}; an exposition from a computational biology perspective can be found in \cite{beuter2003nonlinear,hoppensteadt2012weakly,izhikevich2007dynamical}.
The author particularly recommends \cite{strogatz2018nonlinear} for a broad and very readable introduction to the field.

Bifurcation theory considers changes in the dynamics of a system when a parameter is varied.
A change is said to have occurred when the before and after dynamics are not equivalent.
A topological definition of equivalence is typically adopted -- two systems are said to be topologically equivalent if and only if there exists a homeomorphism between their phase portraits.
One can loosely imagine this to mean that two systems have equivalent dynamics, only if they can be stretched, rotated, and bent into the one another.
While the temporal nature of the dynamics may vary between topologically equivalent systems (eg. slow or rapid convergence to equilibria), their general features, such as stability and existence of limit cycles, equilibria et cetera will remain the same.
For example, while the dynamics of a damped fast-swinging pendulum can easily be transformed into that of a damped slow-swinging pendulum, neither can be transformed into a pendulum whose swing amplitude increases in time due to resonance; the fast- and slow-swinging pendula are equivalent, and different to the resonantly excited pendulum.

A system is said to be structurally stable if it is topologically equivalent to any small perturbation within the same class of systems.
That is, the inclusion of additional small terms, or the small perturbation of existing terms, does not produce topologically different dynamics within the system.
Consider the system of differential equations given by

\begin{equation}
\label{eq:org6a5f88b}
\dot{x} = f(x,\lambda)~,
\end{equation}
where \inr{x}{n} is the system state, and \inr{\lambda}{m} is a vector of system parameters.
A bifurcation occurs at parameter value \(\lambda^{\text{*}}\) if the system loses structural stability when \(\lambda = \lambda^*\).
That is, arbitrarily small variations away from \(\lambda^*\) will produce a system with different dynamics to those at \(\lambda^*\).
A bifurcation diagram shows how invariant sets change as a function of parameter value; a bifurcation set shows the sets in parameter space where a system loses structural stability through bifurcation.
\begin{NOTE}
QUESTION: It is possible for a system to not be structurally stable, but also not be at a bifurcation point, eg. \(x^3 + \lambda\) at (0,0). Does that make this definition wrong? How should I rephrase this section to make it right?
\end{NOTE}

The codimension of a bifurcation is the number of parameters that must be varied to generically see that bifurcation.
This can equivalently be thought of as the number of parameters that are required in a bifurcation diagram to make it structurally stable.
If a bifurcation diagram is never structurally stable, the corresponding bifurcation is said to have infinite codimension.
Codimension is used to describe the complexity of a bifurcation.
Few tools exist to study higher-codimension bifurcations.
\begin{NOTE}
QUESTION: Codimension higher than what? Do any tools exist to study codim3 bifurcations? 
\end{NOTE}
