supervision/feb2020/paper_so_far/continuations.org
** TODO : PROOF READ; How does continuation work / do we find bifurcations numerically?
   DEADLINE: <2020-02-27 Thu>

A basic understanding of continuation is necessary for running numerical bifurcation experiments.
Continuation considers the computation of implicitly defined manifolds.   
Consider the system given in equation ([[eq:ODE]]).
An equilibrium is given by \(f(x,\lambda)=0\).
Under certain assumptions _/*WHAT ASSUMPTIONS? SMOOTHNESS? ALSO CITE WHERE THOSE ASSUMPTIONS CAN BE FOUND (SEE [28])*/_, the implicit function theorem guarantees that we can find some manifold \(x(\lambda\)\), giving the location of the equilibrium position as a function of the parameter vector \lambda cite:allgower2003introduction.
Numerical continuation provides a means of computing this manifold, given some starting equilibrium \(x_0\) at parameter value \(\lambda_0\).
In the context of bifurcation analysis, continuation methods are used to track how the solution to a system of equations changes as the parameter vector is varied.
The system of equations is given by the vector field \(f\), and a set of test functions whose zeros occur at a bifurcation; additional regularisation constraints, such as phase constraints, are sometimes required to produce a well-posed problem cite:doedel1991numerical.
See cite:dankowicz2013recipes _/*CHAPTER?*/_ for a detailed discussion on problem formulation.

Numerical bifurcation analysis is thus a problem of tracking the zeros of a system of equations, test functions, and regularisation constraints, as some of the system parameters change.
A numerical investigation of bifurcations generally proceeds by 
  1. finding equilibria (codimension zero points);
  2. tracking those equilibria under single-parameter changes, to reveal codimension 1 bifurcations;
  3. tracking these codimension-1 bifurcations in multiple parameters, to find higher codimension singularities.
It is useful to understand bifurcation analysis as being a problem of computing implicitly defined manifolds, as it explains why numerical bifurcation analysis must be approached in this fashion.
One must first find points where equilibria bifurcates, by tracking the equilibria as a parameter changes WHICH IS COMPUTING AN IMPLICIT MANIFOLD.
This will indicate the locations of codimension-1 bifurcations, which occur at zero-dimensional points in a one-dimensional parameter space.
By augmenting the equilibrium problem with test functions, these bifurcations can then be tracked as two parameters are varied WHICH IS COMPUTING AN IMPLICIT MANIFOLD IN THE AUGMENTED SYSTEM.
Higher-codimension bifurcations form organising centers, from which manifolds of lower-codimension bifurcations emerge.
One therefore proceeds by finding and tracking interesting points in successively higher codimension.
#+BEGIN_NOTE 
TODO fix the bits in caps in the above paragraph 
#+END_NOTE

Continuation is performed using a psuedo-arclength predictor corrector scheme cite:keller1977numerical.
Here, the next point on the manifold is estimated using its tangent at the previous point, and a corrector scheme is used to refine this estimate.
This is designed to replicate the parameterisation of the manifold in terms of arc length from the initial point, allowing for continuation around fold points.
While numerical psuedo-arclength continuation is the standard method of bifurction analysis, several variations to this approach have been developed.
These include control-based continuation algorithms, for investigating the bifurcation structure of physical and black-box systems cite:pyragas1992continuous,pyragas2001control,barton2013systematic,sieber2008control, and inverse bifurcation algorithms, for discovering parameter configurations that produces some target bifurcation structure.
Control-based continuation has recently been applied to an /in silico/ gene regulatory network cite:gomes2019exploring.
An introduction to inverse problems is given in cite:engl2005nonlinear,engl2009inverse, with cite:engl2009inverse giving a discussion of their applications to systems biology.
Inverse methods have been applied variously to designing gene networks that exhibit a specific set of dynamics cite:lu2006inverse, and producing systems that are robust to parameter noise cite:kitajima2015method.
An entirely different approach to bifurcation analysis is taken in cite:chickarmane2005bifurcation, where a genetic algorithm is used to search for bifurcations in the parameter space of ODE reaction networks.

 #+BEGIN_COMMENT
TODO Read Kuznetsov before writing this section.

Meijer, Hil, Fabio Dercole, and Bart E. Oldeman. "Numerical Bifurcation Analysis." (2009): 6329-6352.

provides a comprehensive review of how continuation works.

https://link.springer.com/chapter/10.1007/978-1-4020-6356-5_2
(interactive continuation tools, chapter 2 of numerical continuation methods for dynamical systems)
will also provide lots of detail on how it works.

Psuedo-arclength continuation seems to be invented in

 Keller, Herbert B. "Numerical solution of bifurcation and nonlinear eigenvalue problems." (1977).

QUESTION Everyone cites the paper, but I can't find it anywhere. It only seems to exist as a citation. Huh?

TODO find more example review papers of how continuation methods apply to biology!
 #+END_COMMENT
   

* TODO an overview of the available tools, their strengths and limitations, usages, etc.
