supervision/feb2020/paper_so_far/continuations.org
** TODO : PROOF READ; PyDSTool
   DEADLINE: <2020-02-18 Tue>
_*/TODO HOW MUCH OF THIS IS ACTUALLY NECESSARY INFORMATION?/*_
PyDSTool provides a suite of tools for the simulation and analysis of dynamical systems, with a focus on biological applications cite:clewley2012hybrid.
It is written primarily in Python3, however legacy C and Fortran code is included for efficient numerical solvers.
Being written in Python3, PyDSTool is particularly easy to adapt and extend to new problems.
The code is released under the permissive BSD 3-clause license, which allows for modification and redistribution of the source code.
PyDSTool supports ordinary differential equations, differential algebraic equations, discrete maps, and hybrid models thereof.
Limited support is also available for delay differential equations, however these do not form the focus of PyDSTool; more specialised packages such as pydelay cite:FLU09a, Knut cite:szalaiknut, or DDE-BIFTOOL cite:engelborghs2002numerical are better suited to such problems.

_*/TODO REPHRASE THIS PARA/*_
PyDSTool has no graphical user interface.
Instead, modelling and analysis procedures are specified through Python scripts.
This has the advantage of allowing for more sophisticated and complex analysis routines than could be achieved with a graphical interface.
It makes it easy to rapidly run and rerun analyses, reproduce research, and to change the model and any aspects of its analysis, without having to repeat the entire procedure from scratch; instead, the script can simply be rerun after any desired alterations have been made.
Rich data structures are provided to facilitate this.
These can be integrated into other work, to extend the capabilities of PyDSTool, and to apply its methods and routines to other problems.

_*/TODO IS THIS TOO MUCH INFORMATION ABOUT HYBRID SYSTEMS?/*_
Unlike other software packages, PyDSTool offers advanced support for hybrid models.
These can be considered loosely as a set of different regimes of smooth dynamics, and a set of events-based rules to dictate when and how transitions between these regimes should occur; see cite:simic2005towards for a rigorous treatment of hybrid dynamical systems.
Hybrid modelling can allow one to express key system behaviours in a significantly simpler way than could otherwise be achieved.
A key example of this is the integrate and fire neuron (see cite:gerstner2014neuronal section 1.3).
Here, a neuron is modelled as integrating any applied current, and firing a spike when the membrane potential exceeds a threshold.
The membrane potential then resets to a resting state.
This non-smooth model succeeds in abstracting away the complex dynamics of spike generation, resulting in a simple model that still captures the essence of neuronal behaviours.
While hybrid modelling is a powerful tool for biological analysis, only PyDSTool is explicitly designed for building and analysing these models.

_/*TODO GENERALLY OKAY. SHOULD I TALK MORE ABOUT THE PHASE PLANE / COMP NEURO TOOLBOX CAPABILITIES?*/_
Models are specified symbolically; symbolic expression routines exist for manipulating derivatives, substitutions, evaluations, and simplifications.
Individual models can optionally be combined together, to form hybrid models.
These models can then be simulated and analysed.
Toolboxes exist for a range of purposes, with examples including parameter fitting and estimation, compartmental modelling of neurons and chemical synapses, and phase plane analysis.
Continuation methods are implemented to detect and track bifurcations in parameter space; these are considered in more depth in section [[*a comparison of those tools and their functionality]].

#+BEGIN_COMMENT
    - [X] How do we engage with PyDSTool?
      - [X] Scripting interface
      - [X] Write code in python to define models, continuation procedures, etc.
      - [X] Since it's written pretty much all in python, we can also integrate the code and data structures into other projects, and extend it easily

    - [X] What is a hybrid DS and why are they a useful idea?
    /A hybrid dynamical system can be loosely considered as a set of smooth dynamical regimes, and a set of events- based rules to dictate transitions between these regimes; see [cite simic 2005] for a rigorous definition.
    Such a modelling approach is useful because [can simplify things], see [example sources]/

    - [X] What support does it offer? (symb math, hybrid systems, phase plane / bifurcation toolboxes, etc.)
      - [X] Toolboxes including biomech, comp neuro, systems biology, optimisers / parameter estimators, phase plane, pycont to analyse models
      - [X] Easy way to specify models
        - [X] Symbolic expression utilities (including evaluation, substitution, derivatives, some simplification) (see Symbolic).
        - [X] Easy to build complex models using hierarchical object-oriented data structures that contain composable model specifications (see ModelSpec).

    - [ ] Any nice touches that are worth noting?
#+END_COMMENT
#+BEGIN_COMMENT
THINGS TO WRITE ABOUT FOR PYDSTOOL
      - Interface: scripting only
      - Provides a full set of tools for development, simulation, and analysis of dynamical system models.
      'supports symbolic math, optimisation, phase plane analysis, continuation and bifurcation analysis, data analysis,' etc. (quoted from [5]).
      - Easy to build into existing code.
      - Can reuse bits and pieces (eg. continuation, or modelling) for building more complex software.
      - Learn-by-example tutorials provided in the examples directory of the code repo [4], and fairly comprehensive documentation available on the website [5].

     - Both a simulation and an analysis environment
     - analysis of [insert system types here]
     - requires user to code in python; package then generates c and fortran code for fast solving
     - delare functions, variables, parameters, etc. in a nice index-free (.ode file style) way
     - can be used for simulating, phase plane analysis, continuation / bifurcation analysis, and misc toolbox stuff
     - easy to extend and interface with other code
     - aimed at tools to model and analyse physical systems from science and maths, but particularly appropriate for those arising in biology

#+END_COMMENT
#+BEGIN_COMMENT
STUFF ON HYBRID SYSTEMS
Define what a hybrid dynamical system actually is. See

Carloni L, DiBenedetto M, Pinto A, Sangiovanni-Vincentelli A (2004) Modeling techniques, programming languages, and design toolsets for hybrid systems. Technical report, IST-2001-38314 WPHS, Columbus Project.

and

Simic, Slobodan N., et al. "Towards a geometric theory of hybrid systems." Dynamics of Continuous, Discrete and Impulsive Systems Series B: Applications and Algorithms 12.5-6 (2005): 649-687.

for references.
Also see

Maas U, Pope SB (1992) Simplifying chemical kinetics: Intrinsic low dimensional manifolds in composition space,
Deuhard P, Heroth J (1996) Dynamic dimension reduction in ODE models

for examples on how hybrid dynamical systems can simplify analysis.
PyDSTool is basically the only tool to allow hybrid systems.
It also supports DAEs, ODEs, and maps, and has arbitrary-precision event detection, which lots of other systems don't offer.

Hybrid models are designed in a way as to be most applicable to bio fields.
Smooth dynamics, switched between with discrete events.
Can be constructed from mixtures of maps, ODEs, DAEs, prefefined trajectories.
The model can also be a hybrid of just itself, where the transitions are back to the same model but with new ICs, eg. the integrate and fire neuron.
Could also have a model fitter as part of the system, to eg. fit a lower-dimensional system to the data as it's being generated, or, to replace some subsystem with recorded time series information for some reason.
This allows us to build simpler models of complex systems.
#+END_COMMENT

