supervision/feb1010wk5wk6/paper_so_far/continuations.tex
\subsection{{\bfseries\sffamily TODO} : PROOF READ; PyDSTool}
\label{sec:org4bff84c}
\uline{\textbf{\emph{TODO HOW MUCH OF THIS IS ACTUALLY NECESSARY INFORMATION?}}}
PyDSTool provides a suite of tools for the simulation and analysis of dynamical systems, with a focus on biological applications \cite{clewley2012hybrid}.
It is written primarily in Python3, however legacy C and Fortran code is included for efficient numerical solvers.
Being written in Python3, PyDSTool is particularly easy to adapt and extend to new problems.
The code is released under the permissive BSD 3-clause license, which allows for modification and redistribution of the source code.
PyDSTool supports ordinary differential equations, differential algebraic equations, discrete maps, and hybrid models thereof.
Limited support is also available for delay differential equations, however these do not form the focus of PyDSTool; more specialised packages such as pydelay \cite{FLU09a}, Knut \cite{szalaiknut}, or DDE-BIFTOOL \cite{engelborghs2002numerical} are better suited to such problems.

\uline{\textbf{\emph{TODO REPHRASE THIS PARA}}}
PyDSTool has no graphical user interface.
Instead, modelling and analysis procedures are specified through Python scripts.
This has the advantage of allowing for more sophisticated and complex analysis routines than could be achieved with a graphical interface.
It makes it easy to rapidly run and rerun analyses, reproduce research, and to change the model and any aspects of its analysis, without having to repeat the entire procedure from scratch; instead, the script can simply be rerun after any desired alterations have been made.
Rich data structures are provided to facilitate this.
These can be integrated into other work, to extend the capabilities of PyDSTool, and to apply its methods and routines to other problems.

\uline{\textbf{\emph{TODO IS THIS TOO MUCH INFORMATION ABOUT HYBRID SYSTEMS?}}}
Unlike other software packages, PyDSTool offers advanced support for hybrid models.
These can be considered loosely as a set of different regimes of smooth dynamics, and a set of events-based rules to dictate when and how transitions between these regimes should occur; see \cite{simic2005towards} for a rigorous treatment of hybrid dynamical systems.
Hybrid modelling can allow one to express key system behaviours in a significantly simpler way than could otherwise be achieved.
A key example of this is the integrate and fire neuron (see \cite{gerstner2014neuronal} section 1.3).
Here, a neuron is modelled as integrating any applied current, and firing a spike when the membrane potential exceeds a threshold.
The membrane potential then resets to a resting state.
This non-smooth model succeeds in abstracting away the complex dynamics of spike generation, resulting in a simple model that still captures the essence of neuronal behaviours.
While hybrid modelling is a powerful tool for biological analysis, only PyDSTool is explicitly designed for building and analysing these models.

\uline{\emph{\textbf{TODO GENERALLY OKAY. SHOULD I TALK MORE ABOUT THE PHASE PLANE / COMP NEURO TOOLBOX CAPABILITIES?}}}
Models are specified symbolically; symbolic expression routines exist for manipulating derivatives, substitutions, evaluations, and simplifications.
Individual models can optionally be combined together, to form hybrid models.
These models can then be simulated and analysed.
Toolboxes exist for a range of purposes, with examples including parameter fitting and estimation, compartmental modelling of neurons and chemical synapses, and phase plane analysis.
Continuation methods are implemented to detect and track bifurcations in parameter space; these are considered in more depth in section \ref{sec:org21952ee}.
