supervision/feb2020/paper_so_far/continuations.org
** TODO : PROOF READ; XPPAUTO

XPP (also referred to as XPPAUT, XPPAUTO) is a combined simulation and continuation package cite:ermentrout2002simulating.
It is one of the oldest dynamical systems tools to still see regular use, and as a result, has seen extensive use for solving and analysing problems across nonlinear dynamics.
A large number of tutorials and resources are available because of this.
Nevertheless, the age of the software also lends itself to a somewhat /`clunky'/ user interface.
The program also has a tendency to crash; no scripting interface is available, which means that in the event of a crash, one must restart an entire analysis from scratch.

XPP is capable of handing a wide range of system classes, including ordinary, delay, and stochastic differential equations, boundary value problems, and difference and functional equations.
The package is written in C, and source code is released under the GNU GPL v3 license, allowing for modification and redistribution.
Nevertheless, the code base does not easily lend itself towards being extended and adapted to novel problems.
XPP is used through a graphical interface and models are specified symbolically in text files, meaning no knowlege of coding is required to use the software.
Furthermore, XPP provides a graphical interface to most features of AUTO cite:dhooge2008new,doedel1981auto, allowing users to run continuation and bifurcation analyses without writing any Fortran code.

XPP has a wide range of features, both within and in addition to simulation and bifurcation analysis.
Over a dozen solvers are available, covering forward and backward integration for a range of stiff and non-stiff classes of system.
Tools are also provided for phase plane analysis, such as nullcline, vector field, and flow field plotting, and equilibrium location methods.
Methods exist to create Poincar\eacute sections and animations directly from XPP.

#+BEGIN_COMMENT
NOTES
      The 'classic' simulation and continuation software.
      Still sees active use in a large range of nonlinear problems.
      Bifurcation (continuation) methods provided by AUTO and HomCont; probably possible to use AUTO by itself, but no one does because it would be very difficult (needs FORTRAN coding), and XPP provides a good interface to do it.
      Takes plain-text input files, with equations written out in text, as opposed to being defined by user-written functions like in eg. matlab.
      From [1], ...
      Over a dozen different solvers, covering stiff systems, integral equations, etc.
      Supports Poincare sections, nullcline plotting, flow fields, etc., so it's good for visualisation, as well as bifurcation analysis.
      No command line interface.
      Can produce animations in it (somehow?).
      Since it's so popular, there's a wealth of tutorials available for it.
      Somewhat outdated GUI, but it does the job perfectly adequately.
      Buggy, sometimes segfaults.


THINGS TO INCLUDE
     - Background to the software - who wrote it, what for, when, why?
     - What does it try to do / solve?
     - What problems / users is it aimed at?
     - What nice touches does it have to make it worth using? Toolboxes? Scripting? Exports? Simulation? Phase planes?
     - Only describe the tools here, don't compare them to each other!

     - Both a simulation and an analysis environment
     - analysis of [insert system types here]
     - can be used entirely gui-based, so no need to do any coding for it
     - write functions and stuff in words, rather than program them as code functions
     - can be used for simulating, phase plane analysis, continuation / bifurcation analysis, and misc toolbox stuff

OVERVIEW
      - Language: C
      - Interface: GUI only
      - Usage: ODEs, DDEs, SDEs, BVPs, difference equations, functional equations
      - License: GNU GPL V3

      Comprehensive tutorial provided by Ermentrout here: http://www.math.pitt.edu/~bard/bardware/tut/start.html#toc


#+END_COMMENT

** TODO : PROOF READ; \matcont{}
   DEADLINE: <2020-02-20 Thu>
   
_/*IS THIS TOO OPINION-BASED?*/_
\matcont{} focuses on providing a comprehensive set of simulation and analysis tools, for ordinary differential equations only.
The package aims to overcome the shortfalls of previous bifurcation analysis tools (such as detection, continuation, and normal form calculations of codimension-2 bifurcations), and is thus the most fully featured of the tools considered here.
The intuitive graphical interface lends itself towards a more gentle learning curve than for other tools.
\matcont{} is freely available under the Creative Commons BY-NC-SA 3.0 license, allowing users to modify and redistribute the software, subject to constraints.
Note that \matcont{} is written for use with MATLAB, and thus requires a MATLAB license; the author was unable to run \matcont{} in GNU Octave in its provided form.

While being the most powerful tool of those discussed here, \matcont{} is also extensively and clearly documented, and a large number of tutorials are available.
It is available both as a graphical package, and as the command-line version \clmatcont{}.
This means that users are not required to write any code to use \matcont{}; nevertheless, the graphical interface merely acts as an intermediary between the user and \clmatcont{}, so analyses can be carried out just as effectively in a scripting environment, should the user desire.
\clmatcont{} also allows one to extend the functionality of the software, by integrating \matcont{} routines into custom projects.

\matcont{} has a well-designed memory management system, allowing curves and points of interest to be saved automatically.
As a result, users are not forced to re-run analyses from scratch each time a system is studied, even when working from the graphical interface.

Models are provided symbolically to \matcont{}.
The software is able to compute derivatives symbolically, allowing for faster code execution, and improved precision.
It supports additional features such as Poincar\eacute maps and phase repsonse curves, and is the only software to support normal form analysis of limit cycle bifurcations, using the methods developed in cite:kuznetsov2005numerical.
Users have access to all MATLAB solvers, in addition to two additional Runge-Kutta solvers for stiff systems.

#+BEGIN_COMMENT
TODO
THINGS TO INCLUDE
     - Background to the software - who wrote it, what for, when, why?
     - What does it try to do / solve?
     - What problems / users is it aimed at?
     - What nice touches does it have to make it worth using? Toolboxes? Scripting? Exports? Simulation? Phase planes?
     - Only describe the tools here, don't compare them to each other!

SOME NOTES ON MATCONT
     - Both a simulation and an analysis environment
     - analysis of [insert system types here]
     - can be used entirely gui-based, so no need to do any coding for it
     - write functions and stuff in .ode file style, rather than as code
 
      - Language: MATLAB
      - Interface: GUI only, but CL_MatCont exists as a command-line version
      - Usage: """""TODO""""""
      - License: Creative Commons Attribution-NonCommercial-ShareAlike 3.0 unported
      Also: CL_MatCont (commandline interface), MatContM (MatCont for maps)
      
Can simulate, make Poincare maps, use all matlab solvers plus more (ode78, ode87, for stiff systems)
Can compute phase response curves, useful for oscillator and synchronisation (so can XPP. Can PyDSTool and CoCo?)
Only tool to support normal form analysis of LC bifurcations, 
#+END_COMMENT

** TODO CoCo
   DEADLINE: <2020-02-24 Mon>
#+BEGIN_NOTE 
     - Background to the software - who wrote it, what for, when, why?
     - What systems can it analyse?
     - What does it try to do / solve? What niche was it created to fill?
     - What problems / users is it aimed at?
     - What nice touches does it have to make it worth using? Toolboxes? Scripting? Exports? Simulation? Phase planes?
     - Only describe the tools here, don't compare them to each other!
     - CoCo is only an analysis environment, though it's used through matlab, which simulations could be run in
     - requires user to code the problem in matlab
     - functions, variables, etc. are declared in Matlab syntax
#+END_NOTE
   

* TODO a comparison of those tools and their functionality

#+BEGIN_NOTE 
Notes to work into the text somewhere:
  - PyDSTool and XPP integrators are significantly faster than CoCo / MatCont's matlab integrators.
  - PyDSTool can support arbitrarily large models, which XPP can't
  - MatCont and PyDSTool's bifurcation analysis is closer-integrated with its simulation / core tools than for XPP 
  - CoCo, PyDSTool and CL_MatCont can be scripted, and integrated into other programs; XPP cannot easily, however some attemts at interfaces exist (see website).
  - XPP and MatCont have GUIs; PyDSTool and CoCo do not
#+END_NOTE
  
