supervision/feb1010wk5wk6/paper_so_far/continuations.tex

\subsection{{\bfseries\sffamily TODO} : PROOF READ; XPPAUTO}
\label{sec:org898b79c}

XPP (also referred to as XPPAUT, XPPAUTO) is a combined simulation and continuation package \cite{ermentrout2002simulating}.
It is one of the oldest dynamical systems tools to still see regular use, and as a result, has seen extensive use for solving and analysing problems across nonlinear dynamics.
A large number of tutorials and resources are available because of this.
Nevertheless, the age of the software also lends itself to a somewhat \emph{`clunky'} user interface.
The program also has a tendency to crash; no scripting interface is available, which means that in the event of a crash, one must restart an entire analysis from scratch.

XPP is capable of handing a wide range of system classes, including ordinary, delay, and stochastic differential equations, boundary value problems, and difference and functional equations.
The package is written in C, and source code is released under the GNU GPL v3 license, allowing for modification and redistribution.
Nevertheless, the code base does not easily lend itself towards being extended and adapted to novel problems.
XPP is used through a graphical interface and models are specified symbolically in text files, meaning no knowlege of coding is required to use the software.
Furthermore, XPP provides a graphical interface to most features of AUTO \cite{dhooge2008new,doedel1981auto}, allowing users to run continuation and bifurcation analyses without writing any Fortran code.

XPP has a wide range of features, both within and in addition to simulation and bifurcation analysis.
Over a dozen solvers are available, covering forward and backward integration for a range of stiff and non-stiff classes of system.
Tools are also provided for phase plane analysis, such as nullcline, vector field, and flow field plotting, and equilibrium location methods.
Methods exist to create Poincar\'{e} sections and animations directly from XPP.

\subsection{{\bfseries\sffamily TODO} : PROOF READ; \matcont{}}
\label{sec:org99d3f31}
\uline{\emph{\textbf{IS THIS TOO OPINION-BASED?}}}
\matcont{} focuses on providing a comprehensive set of simulation and analysis tools, for ordinary differential equations only.
The package aims to overcome the shortfalls of previous bifurcation analysis tools (such as detection, continuation, and normal form calculations of codimension-2 bifurcations), and is thus the most fully featured of the tools considered here.
The intuitive graphical interface lends itself towards a more gentle learning curve than for other tools.
\matcont{} is freely available under the Creative Commons BY-NC-SA 3.0 license, allowing users to modify and redistribute the software, subject to constraints.
Note that \matcont{} is written for use with MATLAB, and thus requires a MATLAB license; the author was unable to run \matcont{} in GNU Octave in its provided form.

While being the most powerful tool of those discussed here, \matcont{} is also extensively and clearly documented, and a large number of tutorials are available.
It is available both as a graphical package, and as the command-line version \clmatcont{}.
This means that users are not required to write any code to use \matcont{}; nevertheless, the graphical interface merely acts as an intermediary between the user and \clmatcont{}, so analyses can be carried out just as effectively in a scripting environment, should the user desire.
\clmatcont{} also allows one to extend the functionality of the software, by integrating \matcont{} routines into custom projects.

\matcont{} has a well-designed memory management system, allowing curves and points of interest to be saved automatically.
As a result, users are not forced to re-run analyses from scratch each time a system is studied, even when working from the graphical interface.

Models are provided symbolically to \matcont{}.
The software is able to compute derivatives symbolically, allowing for faster code execution, and improved precision.
It supports additional features such as Poincar\'{e} maps and phase repsonse curves, and is the only software to support normal form analysis of limit cycle bifurcations, using the methods developed in \cite{kuznetsov2005numerical}.
Users have access to all MATLAB solvers, in addition to two additional Runge-Kutta solvers for stiff systems.

\subsection{{\bfseries\sffamily TODO} CoCo}
\label{sec:orgae87578}
\begin{NOTE}
\begin{itemize}
\item Background to the software - who wrote it, what for, when, why?
\item What systems can it analyse?
\item What does it try to do / solve? What niche was it created to fill?
\item What problems / users is it aimed at?
\item What nice touches does it have to make it worth using? Toolboxes? Scripting? Exports? Simulation? Phase planes?
\item Only describe the tools here, don't compare them to each other!
\item CoCo is only an analysis environment, though it's used through matlab, which simulations could be run in
\item requires user to code the problem in matlab
\item functions, variables, etc. are declared in Matlab syntax
\end{itemize}
\end{NOTE}


\section{{\bfseries\sffamily TODO} a comparison of those tools and their functionality}
\label{sec:org21952ee}

\begin{NOTE}
Notes to work into the text somewhere:
\begin{itemize}
\item PyDSTool and XPP integrators are significantly faster than CoCo / MatCont's matlab integrators.
\item PyDSTool can support arbitrarily large models, which XPP can't
\item MatCont and PyDSTool's bifurcation analysis is closer-integrated with its simulation / core tools than for XPP
\item CoCo, PyDSTool and CL\(_{\text{MatCont}}\) can be scripted, and integrated into other programs; XPP cannot easily, however some attemts at interfaces exist (see website).
\item XPP and MatCont have GUIs; PyDSTool and CoCo do not
\end{itemize}
\end{NOTE}
