supervision/feb2020/paper_so_far/continuations.org
*** Types of system each software can handle

   
 | System            | \matcont{}  | CoCo | XPP                | PyDSTool |
 |-------------------+-------------+------+--------------------+----------|
 | ODE               | y           | ?    | y                  | y        |
 | PDE (discretized) | n           | ?    | y                  | n        |
 | DDE               | n           | ?    | y                  | limited  |
 | SDE               | n           | ?    | y                  | limited  |
 | DAE               | n           | ?    | y                  | y        |
 | BVP               | n           | ?    | y                  | n        |
 | Maps              | \matcontm{} | ?    | y                  | y        |
 | Hybrid            | n           | ?    | basic (apparently) | y        |
 | Integral          | n           | ?    | y                  | n        |
 | Functional        | n           | ?    | y                  | n        |

#+BEGIN_NOTE 
QUESTION I'm yet to look at what CoCo is and isn't capable of analysing. Ask Ludovic for some pointers?

QUESTION While XPP is capable of simulating all the noted systems, I don't know if that is literally just XPP simulating them, or also that AUTO is able to run continuations with them. Ask supervisors for advice.
#+END_NOTE

*** Types of point each software can study

    - D: software can detect this invariant set
    - C: software can continue this invariant set

 | Point label | Point type             | Codim | MATCONT | CoCo | XPP   | PyDSTool |
 |-------------+------------------------+-------+---------+------+-------+----------|
 | EP          | Equilibrium            |     0 | D,C     |      | D,C   | D,C      |
 | LC          | Limit cycle            |     0 | D,C     |      | D,C   | D,C      |
 | LP          | Limit point            |     1 | D,C     |      | D,C   | D,C      |
 | H           | Hopf                   |     1 | D,C     |      | D,C   | D,C      |
 | LPC         | Limit point of cycles  |     1 | D,C     |      | ?-?   | D        |
 | NS          | Neimark-Sacker         |     1 | D,C     |      | ???   | D,**     |
 | Torus bif   | ??????????????         |       | ??????  |      | D,??? | ???????  |
 | PD          | Period doubling        |     1 | D       |      | D,C   | D,**     |
 | BP *        | Branch point           |       | D,C     |      | D,?   | D,?      |
 | CP          | Cusp                   |     2 | D       |      | ?-?   | D        |
 | BT          | Bogdanov Takens        |     2 | D       |      | ?-?   | D        |
 | ZH          | Zero-Hopf              |     2 | D       |      | ?-?   | D        |
 | HH          | Double Hopf            |     2 | D       |      | ?-?   | D        |
 | GH          | Generalised Hopf       |     2 | D       |      | ?-?   | D        |
 | BPC *       | Branch point of cycles |       | D       |      | ?-?   | ?        |
 | CPC         | Cusp point of cycles   |     2 | D       |      | ?-?   | -        |
 | CH          | Chenciner              |     2 | D       |      | ?-?   | -        |
 | LPNS        | Fold-Neimark-Sacker    |     2 | D       |      | ?-?   | -        |
 | PDNS        | Flip-Neimark-Sacker    |     2 | D       |      | ?-?   | -        |
 | LPPD        | Fold-Flip              |     2 | D       |      | ?-?   | -        |
 | NSNS        | Double Niemark-Sacker  |     2 | D       |      | ?-?   | -        |
 | GPD         | Generalised flip       |     2 | D       |      | ?-?   | -        |

#+BEGIN_NOTE 
 - QUESTION: Is torus bifurcation the same as Neimark-Sacker, or are NS a map bifurcation and torus the flows equivalent?
 - * QUESTION: Are branch points just 'there's a bifurcation here but we don't know what type specifically'? In that case, any bifurcation that occurs, but isn't one of the labelled ones, would still be detected as a BP.
 - Also see the MATCONT 'objects related to homoclinics to equilibria' table, and resonances, for additional /stuff/ it can detect / continue
 - ** QUESTION: PyDSTool seems to have methods to continue these for fixed points of maps; does that mean they're a maps-only type of curve? Note that it lacks documentation and tests/examples about these methods, so maybe they're not implemented?
#+END_NOTE
 

#+BEGIN_COMMENT

Comparison tables:
	  - Bifurcations it can do, curves it can continue, and the types of system they can use
	  - When they fail, crash, etc.
	  - Numerical methods they have available
	  - How much do the parameters need manually fiddling?
	  - Do we need to code or not?

 | PyDSTool                                    | XPP                                         | MATCONT                               |
 |---------------------------------------------+---------------------------------------------+---------------------------------------|
 | Arbitrarily large systems                   | No heirarchical composition-based modelling |                                       |
 | Wider range of DE RHS, but no stochastics   | Supports stochastic RHS                     |                                       |
 | SUpports long names                         | 9 character max. for names                  |                                       |
 | Scriptable                                  | Not scriptable                              |                                       |
 | Can embed simulations in other environments | Can only use as a standalone box            |                                       |
 | Limited DDE support                         | Supports general DDEs                       |                                       |
 | Fewer integrators than XPP                  | Supports more ODE integrators than PyDSTool |                                       |
 | No BVP solver                               | Has a BVP solver                            |                                       |
 | Slower than XPP, as fast as MATCONT         | Written in C / fortran. Fast!               | Slower than XPP, as fast as PyDSTool  |
 | Closer integration with the programming env | Hard to interface with other programming    | Harder to integrate with other coding |
 |                                             |                                             |                                       |
 


 | Thing                          | MATCONT                                         | CoCo | XPP | PyDSTool |
 |--------------------------------+-------------------------------------------------+------+-----+----------|
 | Toolboxes                      | biomechanical, compneuro, systems biology       |      |     |          |
 | Auto C code generation         | Yes, for ODE/ DAE / map simulations             |      |     |          |
 | Bounds safety                  | Yes, can preserve eg. non-negativity            |      |     |          |
 | Index-free system              | Yes, making for clear syntax                    |      |     |          |
 | Extensible                     | Yes, can easily build on the code and expand it |      |     |          |
 | Heirarchical model composition | Yes                                             |      |     |          |
 | Events detection               | Yes                                             |      |     |          |
 | Symbolic manipulation          | Yes                                             |      |     |          |
 | Memory management utilities    | Yes, inc. LaTeX markup export, smbl conversion  |      |     |          |
 | Parameter estimation / fitting | Yes, toolboxes for that                         |      |     |          |

#+END_COMMENT

*** COMMENT User input method

 | MATCONT             | XPP                 | PyDSTool                 | CoCo                     |
 |---------------------+---------------------+--------------------------+--------------------------|
 | No coding necessary | No coding necessary | Coding required (matlab) | Coding required (matlab) |
 
#+BEGIN_NOTE 
The contents of this table should be discussed in the text, rather than in a table. See section [[*an overview of the available tools, their strengths and limitations, usages, etc.]] and make sure the descriptions are in there.
#+END_NOTE

*** COMMENT Types of points the software can continue

 | Curve label | Curve type                        | MATCONT | CoCo | AUTO | PyDSTool |
 |-------------+-----------------------------------+---------+------+------+----------|
 | EP-C        | Equilibrium                       | y       |      | y    | y        |
 | LP-C        | Limit point / fold                | y       |      | y    | y        |
 | H-C1        | Hopf (method 1)                   | y       |      | y    | y        |
 | H-C2        | Hopf (method 2)                   | -       |      | -    | y        |
 | LC-C        | Limit cycle curve (family of POs) | y       |      | y    | y        |
 |             | Limit point of cycles             | y       |      | ?    | ?        |
 |             | Period doubling                   | y       |      | y    | **       |
 |             | Neimark-Sacker                    | y       |      | y    | **       |
 |             | Homoclinic to saddle              | y       |      | y    | n        |
 |             | Homoclinic to saddle-node         | y       |      | y    | n        |
 | *           | Branch point                      | y       |      |      |          |
 | *           | Branch point of cycles            | y       |      |      |          |
 | *           | ConnectionSaddle                  | y       |      |      |          |
 | *           | ConnectionSaddleNode              | y       |      |      |          |
 | *           | HomotopySaddle                    | y       |      |      |          |
 | *           | HomotopySaddleNode                | y       |      |      |          |
 | *           | ConnectionHet                     | y       |      |      |          |
 | *           | HomotopyHet                       | y       |      |      |          |
 | *           | Heteroclinic                      | y       |      |      |          |

#+BEGIN_NOTE 
  - * What do thes mean? Are they actually a bifurcation curve type? Should they be included at all?
  - ** PyDSTool seems to have methods to compute these curves for fixed points of maps; does that mean they're a maps-only type of curve? If so, should they be set to y? Or, if they're not a maps-only curve but PyDSTool only has routines for finding them in maps, then they should be n.
  - ? indicates that there doesn't appear to be a native way of doing this, however it's possible that there's ways to do it (eg. AUTO97 apparently let's us track LPCs, and PyDSTool let's us define custom curves to follow, so one could possibly construct a customised continuation regime to track limit points of cycles)
#+END_NOTE


