supervision/feb1010wk5wk6/paper_so_far/continuations.tex

\subsubsection{Types of system each software can handle}
\label{sec:orgdf94940}


\begin{center}
\begin{tabular}{lllll}
System & \matcont{} & CoCo & XPP & PyDSTool\\
\hline
ODE & y & ? & y & y\\
PDE (discretized) & n & ? & y & n\\
DDE & n & ? & y & limited\\
SDE & n & ? & y & limited\\
DAE & n & ? & y & y\\
BVP & n & ? & y & n\\
Maps & \matcontm{} & ? & y & y\\
Hybrid & n & ? & basic (apparently) & y\\
Integral & n & ? & y & n\\
Functional & n & ? & y & n\\
\end{tabular}
\end{center}

\begin{NOTE}
QUESTION I'm yet to look at what CoCo is and isn't capable of analysing. Ask Ludovic for some pointers?

QUESTION While XPP is capable of simulating all the noted systems, I don't know if that is literally just XPP simulating them, or also that AUTO is able to run continuations with them. Ask supervisors for advice.
\end{NOTE}

\subsubsection{Types of point each software can study}
\label{sec:org6fbd124}

\begin{itemize}
\item D: software can detect this invariant set
\item C: software can continue this invariant set
\end{itemize}

\begin{center}
\begin{tabular}{llrllll}
Point label & Point type & Codim & MATCONT & CoCo & XPP & PyDSTool\\
\hline
EP & Equilibrium & 0 & D,C &  & D,C & D,C\\
LC & Limit cycle & 0 & D,C &  & D,C & D,C\\
LP & Limit point & 1 & D,C &  & D,C & D,C\\
H & Hopf & 1 & D,C &  & D,C & D,C\\
LPC & Limit point of cycles & 1 & D,C &  & ?-? & D\\
NS & Neimark-Sacker & 1 & D,C &  & ??? & D,**\\
Torus bif & ?????????????? &  & ?????? &  & D,??? & ???????\\
PD & Period doubling & 1 & D &  & D,C & D,**\\
BP * & Branch point &  & D,C &  & D,? & D,?\\
CP & Cusp & 2 & D &  & ?-? & D\\
BT & Bogdanov Takens & 2 & D &  & ?-? & D\\
ZH & Zero-Hopf & 2 & D &  & ?-? & D\\
HH & Double Hopf & 2 & D &  & ?-? & D\\
GH & Generalised Hopf & 2 & D &  & ?-? & D\\
BPC * & Branch point of cycles &  & D &  & ?-? & ?\\
CPC & Cusp point of cycles & 2 & D &  & ?-? & -\\
CH & Chenciner & 2 & D &  & ?-? & -\\
LPNS & Fold-Neimark-Sacker & 2 & D &  & ?-? & -\\
PDNS & Flip-Neimark-Sacker & 2 & D &  & ?-? & -\\
LPPD & Fold-Flip & 2 & D &  & ?-? & -\\
NSNS & Double Niemark-Sacker & 2 & D &  & ?-? & -\\
GPD & Generalised flip & 2 & D &  & ?-? & -\\
\end{tabular}
\end{center}

\begin{NOTE}
\begin{itemize}
\item QUESTION: Is torus bifurcation the same as Neimark-Sacker, or are NS a map bifurcation and torus the flows equivalent?
\item * QUESTION: Are branch points just 'there's a bifurcation here but we don't know what type specifically'? In that case, any bifurcation that occurs, but isn't one of the labelled ones, would still be detected as a BP.
\item Also see the MATCONT 'objects related to homoclinics to equilibria' table, and resonances, for additional \emph{stuff} it can detect / continue
\item ** QUESTION: PyDSTool seems to have methods to continue these for fixed points of maps; does that mean they're a maps-only type of curve? Note that it lacks documentation and tests/examples about these methods, so maybe they're not implemented?
\end{itemize}
\end{NOTE}
