supervision/feb2020/paper_so_far/continuations.org
* TODO examples of using those tools with the Hindmarsh-Rose model
  DEADLINE: <2020-02-25 Tue>
#+BEGIN_COMMENT
When writing, aim it at a biology audience.
Continuation is a sequence of problems - start off at equilibria, then move to tracking codim2 bifurcations, increase the dimension etc.
Make this nice and clear: explain why we're starting off finding any sorts of bifurcations we can, then continuing those to find others.
Aim it at someone that doesn't understand continuation (assume they know what bifurcations are, but not continuation methods for finding them).
A brief section on the maths (eg. why we need to continue from a steady state, and how continuation works) would probably be useful.

INVESTIGATING THE hr MODEL:
    SIMPLIFYING ASSUMPTIONS
     - b is a parameter influencing the bursting and spiking behaviour (frequency of spiking, ability or inability to burst)
     - We want to find the start/stop bifurcations when in a spiking regime, so we fix I=2 to force the neuron to spike
     - Freeze the fast subsystem (so, ignore the slow subsystem)
     - We therefore have two bifurcation parameters - slow subsystem state z, and bursting-spiking parameter b
       
    INVESTIGATION STRATEGY
     - Simulate the neuron for a few different b,z, to see what happens
     - It spikes
     - If the neuron can spike there must be a limit cycle; if there's a planar limit cycle, there must be an equilibrium within it
     - We're interested in when this limit cycle appears or disappears; let's start by investigating how its central equilibrium bifurcates
     - Maybe use find_fixed_pts to find the equilibrium, rather than integrating backwards? Or, do both?

     EQUILIBRIUM BIFURCATION
      (1) Find the equilibrium
	 - Simulate the system to get a (x,y) phase portrait, for arbitrary initial conditions, params
	   * Wikipedia says b=3 is a sensible value, so let's use that to start with
	   * The simulations seem to show I=2 as being a nice (but arbitrarily chosen!) value, so let's use that too
	   * (Emphasise that these were chosen just by playing around with simulations)
	 - This shows a stable limit cycle
	 - Choose some point within the limit cycle and integrate backwards
	 - This allows us to find the (unstable!) equilibrium in the middle of the limit cycle
	   - For I=2, b=3, other params at wikipedia default, this gives an equilibrium at x,y=1,-4
      (2) Do a bifurcation analysis in Z of this equilibrium 
	 - We choose to bifurcate in Z since this is the forcing term applied by the slow subsystem that causes bursting
	 - Since we have a 1d slow subsystem, we must have a hysteresis-loop burster; hyseteresis-loops typically have a Z-shaped nullcline, so let's guess that's going to be the case and plot a bifurcation diagram in (z,x) space
	 - We get two LPs and two Hopf's; the first of these Hopfs occurs at z<-10; this is outside the expected range of z for a typical HR firing, so we'll ignore this one and focus on the other three bifs
      (3) Continue the bifurcations in (z,b) space
	 - Get confused and give up?

#+END_COMMENT


* TODO allude to the existence of non-ODE packages
  DEADLINE: <2020-02-26 Wed>
  
#+BEGIN_COMMENT
 
    'This work doesn't intend to provide a review of all the softwares out there; those included here are not intended to be an exhaustive list' ... 'but provided briefly as possibilies for other work'

DDE Biftool
      - Language: MATLAB
      - Interface: Scripting
      - Usage: DDEs, sd-DDEs
      - License: BSD 2-clause
      - DDE bifurcation analysis only.
      - Described in detail at http://twr.cs.kuleuven.be/research/software/delay/ddebiftool.shtml .
      - Full manual available at [2].
      - Designed for numerical bifurcation analysis of fixed points and periodic orbits, in constant-delay differential equations, and in state-dependent-delay differential equations.
      - Uses orthogonal collocation (???) to continue steady states, periodic orbits.
      - Doesn't provide automatic bifurcation detection, but instead tracks eigenvalue evolution, so that the user can determine bifurcation points.
      - No simulation ability.

Knut
      - Language: C++
      - Interface: GUI, CLI
      - Usage: explicitly time-dependent-delay DDEs
      - License: GNU GPL

       [Info taken verbatim from https://rs1909.github.io/knut/]:
       - Continuation of periodic orbits along a parameter
       - Floquet multiplier calculations
       - Automatic bifurcation detection
       - Continuation of some bifurcations in 2 parameters

Differences from DDE Biftool:
       [Info taken from https://rs1909.github.io/knut/]:
       - C++ makes it faster than MATLAB
       - Standalone software (no need to install matlab as well)
       - GUI-based, with plaintext input, so no need for any programming skills to use it
       - Only software to calculate quasi-periodic tori
       - See reference manual [3] for how-to's
PDECONT
      - Language: C
      - Interface: combination of C and a config file. Matlab interface appears to exist, but no documentation for how to use it
      - Usage: PDE discretisations, large systems of ODEs
      - License: unspecified (open-source, and free for non-commerial use)

      Huge long documentation file exists, but that's just full of code implementations. 
      Couldn't find any clear, straightforward tutorials for using it.
      Need to code in C and produce a big config file to use the software.
      Even then, I can't tell what the code is actually designed to do...
      

pydelay
DSTool
CONTENT
Neuron, NEST, VCell, Bio-SPICE, etc
     - Neuron: Carnevale 2006
     - NEST: Neural simulation technology
     - VCell: Schaff 1999 the virtual cell
     - BioSPICE ???
     - Brian project
     - Chaste
     - SloppyCell
     - ...
#+END_COMMENT

#+BEGIN_NOTE 
How valuable is this section? Should I delete it entirely?
If not, are there tools for stochastics? 
Any additional tools for PDEs / nonsmooth systems?
#+END_NOTE
  
This work does not intend to provide a review of all dynamical systems software.
Nevertheless, common continuation tools for other classes of systems are included here for completeness.

** Other ODE tools
   #+BEGIN_NOTE 
Justify why I haven't studied these here.
Good refs in that textbook about the history of these softwares.
    
 - DSTool
 - CONTENT
 - AUTO
 - ...
   #+END_NOTE


** Delay differential equations
 #+BEGIN_NOTE 
 Brief note about why DDEs are relevant to biology. 

     - Engelborghs, Koen, et al. "Numerical bifurcation analysis of delay differential equations arising from physiological modeling." Journal of mathematical biology 42.4 (2001): 361-385.
    - Luzyanina, Tatyana, Dirk Roose, and Gennady Bocharov. "Numerical bifurcation analysis of immunological models with time delays." Journal of computational and applied mathematics 184.1 (2005): 165-176.
 #+END_NOTE  
DDE BIFTOOL cite:engelborghs2002numerical is a MATLAB package for analysis of systems with fixed delays.
It provides stability analysis and tracking of equilibrium and limit cycle solutions, and is capable of tracking bifurcations.
The interface is script-based.
Knut cite:szalaiknut provides a graphical package for both analysing and simulating DDEs.
It supports stability analysis, orbit continuation, and bifurcation detection in one parameter, and has methods for the two-parameter continuation of some bifurcatons.
Unlike DDE BIFTOOL, it requires no programming knowlege to use; being written in C++, it is also faster.
Pydelay cite:FLU09a provides an easy-to-use package for simulating DDEs in Python3, featuring automatic low-level code generation for efficient solving.
It lacks any analysis tools.


** Partial differential equations
#+BEGIN_NOTE 
Brief note about where PDEs arise in biology 

 - PDECONT
#+END_NOTE


** Non-smooth systems
#+BEGIN_NOTE 
Brief note about where non-smooth dynamics arise in biology 
 - SLIDECONT
 - TC HAT
#+END_NOTE


** Large-scale biological systems
#+BEGIN_NOTE 
Find references comparing all these software.
Presumably there's some. 

 - Neuron
 - NEST
 - VCell
 - Bio-SPICE
 - Brian
 - Chaste
 - SloppyCell
#+END_NOTE


* TODO concluding remarks
  DEADLINE: <2020-02-26 Wed>
  
#+BEGIN_EXPORT latex
\bibliographystyle{unsrt}
\bibliography{references}
#+END_EXPORT


* COMMENT Rough work
** Journals
*** Cell systems
 Cell Systems publishes comprehensive full-length reviews on topics of
 interest to the journal's broad readership. Reviews are usually less
 than 8,000 words in length (including an abstract that is no more than
 150 words) and contain up to 100 references and three to five figures.

** Tool notes
*** Tool background
**** TODO PyDSTool
     - Background to the software - who wrote it, what for, when, why?
     - What does it try to do / solve?
     - What problems / users is it aimed at?
     - What nice touches does it have to make it worth using? Toolboxes? Scripting? Exports? Simulation? Phase planes?
     - Only describe the tools here, don't compare them to each other!

     - Both a simulation and an analysis environment
     - analysis of [insert system types here]
     - requires user to code in python; package then generates c and fortran code for fast solving
     - delare functions, variables, parameters, etc. in a nice index-free (.ode file style) way
     - can be used for simulating, phase plane analysis, continuation / bifurcation analysis, and misc toolbox stuff
     - easy to extend and interface with other code
     - aimed at tools to model and analyse physical systems from science and maths, but particularly appropriate for those arising in biology
**** TODO CoCo
     - Background to the software - who wrote it, what for, when, why?
     - What does it try to do / solve?
     - What problems / users is it aimed at?
     - What nice touches does it have to make it worth using? Toolboxes? Scripting? Exports? Simulation? Phase planes?
     - Only describe the tools here, don't compare them to each other!
     

     - Only an analysis environment, though it's used through matlab, which simulations could be run in
     - analysis of [insert system types here]
     - requires user to code the problem in matlab
     - declare functions, variables, etc. in Matlab syntax
**** TODO MATCONT
     - Background to the software - who wrote it, what for, when, why?
     - What does it try to do / solve?
     - What problems / users is it aimed at?
     - What nice touches does it have to make it worth using? Toolboxes? Scripting? Exports? Simulation? Phase planes?
     - Only describe the tools here, don't compare them to each other!

     - Both a simulation and an analysis environment
     - analysis of [insert system types here]
     - can be used entirely gui-based, so no need to do any coding for it
     - write functions and stuff in .ode file style, rather than as code
**** TODO XPPAUT
     - Background to the software - who wrote it, what for, when, why?
     - What does it try to do / solve?
     - What problems / users is it aimed at?
     - What nice touches does it have to make it worth using? Toolboxes? Scripting? Exports? Simulation? Phase planes?
     - Only describe the tools here, don't compare them to each other!

     - Both a simulation and an analysis environment
     - analysis of [insert system types here]
     - can be used entirely gui-based, so no need to do any coding for it
     - write functions and stuff in words, rather than program them as code functions
     - can be used for simulating, phase plane analysis, continuation / bifurcation analysis, and misc toolbox stuff
*** ODE tools
**** XPP
***** Overview
      - Language: C
      - Interface: GUI only
      - Usage: ODEs, DDEs, SDEs, BVPs, difference equations, functional equations
      - License: GNU GPL V3
***** Notes
      The 'classic' simulation and continuation software.
      Still sees active use in a large range of nonlinear problems.
      Bifurcation (continuation) methods provided by AUTO and HomCont; probably possible to use AUTO by itself, but no one does because it would be very difficult (needs FORTRAN coding), and XPP provides a good interface to do it.
      Takes plain-text input files, with equations written out in text, as opposed to being defined by user-written functions like in eg. matlab.
      From [1], ...
      Over a dozen different solvers, covering stiff systems, integral equations, etc.
      Supports Poincare sections, nullcline plotting, flow fields, etc., so it's good for visualisation, as well as bifurcation analysis.
      Can produce animations in it (somehow?).
      Since it's so popular, there's a wealth of tutorials available for it.
      Somewhat outdated GUI, but it does the job perfectly adequately.
      No command line interface.
      Buggy, sometimes segfaults.
