supervision/feb1010wk5wk6/paper_so_far/continuations.tex

\section{{\bfseries\sffamily TODO} examples of using those tools with the Hindmarsh-Rose model}
\label{sec:org0390e19}


\section{{\bfseries\sffamily TODO} allude to the existence of non-ODE packages}
\label{sec:org50c18e5}
\begin{NOTE}
How valuable is this section? Should I delete it entirely?
If not, are there tools for stochastics? 
Any additional tools for PDEs / nonsmooth systems?
\end{NOTE}

This work does not intend to provide a review of all dynamical systems software.
Nevertheless, common continuation tools for other classes of systems are included here for completeness.

\subsection{Other ODE tools}
\label{sec:orgb39197f}
\begin{NOTE}
Justify why I haven't studied these here.
Good refs in that textbook about the history of these softwares.

\begin{itemize}
\item DSTool
\item CONTENT
\item AUTO
\item \ldots{}
\end{itemize}
\end{NOTE}


\subsection{Delay differential equations}
\label{sec:org6f13380}
\begin{NOTE}
Brief note about why DDEs are relevant to biology. 

\begin{itemize}
\item Engelborghs, Koen, et al. "Numerical bifurcation analysis of delay differential equations arising from physiological modeling." Journal of mathematical biology 42.4 (2001): 361-385.
\end{itemize}
\begin{itemize}
\item Luzyanina, Tatyana, Dirk Roose, and Gennady Bocharov. "Numerical bifurcation analysis of immunological models with time delays." Journal of computational and applied mathematics 184.1 (2005): 165-176.
\end{itemize}
\end{NOTE}
DDE BIFTOOL \cite{engelborghs2002numerical} is a MATLAB package for analysis of systems with fixed delays.
It provides stability analysis and tracking of equilibrium and limit cycle solutions, and is capable of tracking bifurcations.
The interface is script-based.
Knut \cite{szalaiknut} provides a graphical package for both analysing and simulating DDEs.
It supports stability analysis, orbit continuation, and bifurcation detection in one parameter, and has methods for the two-parameter continuation of some bifurcatons.
Unlike DDE BIFTOOL, it requires no programming knowlege to use; being written in C++, it is also faster.
Pydelay \cite{FLU09a} provides an easy-to-use package for simulating DDEs in Python3, featuring automatic low-level code generation for efficient solving.
It lacks any analysis tools.


\subsection{Partial differential equations}
\label{sec:org8985838}
\begin{NOTE}
Brief note about where PDEs arise in biology 

\begin{itemize}
\item PDECONT
\end{itemize}
\end{NOTE}


\subsection{Non-smooth systems}
\label{sec:org77050d0}
\begin{NOTE}
Brief note about where non-smooth dynamics arise in biology 
\begin{itemize}
\item SLIDECONT
\item TC HAT
\end{itemize}
\end{NOTE}


\subsection{Large-scale biological systems}
\label{sec:org8818146}
\begin{NOTE}
Find references comparing all these software.
Presumably there's some. 

\begin{itemize}
\item Neuron
\item NEST
\item VCell
\item Bio-SPICE
\item Brian
\item Chaste
\item SloppyCell
\end{itemize}
\end{NOTE}


\section{{\bfseries\sffamily TODO} concluding remarks}
\label{sec:orgce8b720}
\bibliographystyle{unsrt}
\bibliography{references}
\end{document}
